---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.StartNode
source: html/8ea58f28-f362-9c3b-b623-3e84e4e48242.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.StartNode Property

The id of the start analytical node.

## Syntax (C#)
```csharp
public int StartNode { get; }
```